/*ƒаны два целых числа. ¬ыведите значение наибольшего из них. ≈сли числа равны, выведите любое из них.*/

int that_more();

/* ƒаны два целых числа. ѕрограмма должна вывести единицу, если первое число больше второго, двойку, если второе больше первого, или ноль, если они равны. */

int that_more_2();

/* ƒаны три целых числа.Ќайдите наибольшее из них (программа должна вывести ровно одно целое число).
ѕод наибольшим в этой задаче понимаетс€ число, которое не меньше, чем любое другое.*/

int that_more_3();

/* ƒаны три натуральных числа A, B, C. ќпределите, существует ли треугольник с такими сторонами.
≈сли треугольник существует, выведите строку YES, иначе выведите строку NO. */

int existence_triangle();

/* ƒаны три целых числа. ќпределите, сколько среди них совпадающих. ѕрограмма должна вывести одно из чисел:
3 (если все совпадают), 2 (если два совпадает) или 0 (если все числа различны). */

int find_coincidences();

/* Ўахматна€ ладь€ ходит по горизонтали или вертикали. ƒаны две различные клетки шахматной доски, определите,
может ли ладь€ попасть с первой клетки на вторую одним ходом. */

int chess_rook();