#include <iostream>

// N белочек нашли K орешков и решили разделить их поровну. Определите, сколько орешков достанется каждой белочке.

using namespace std;
int main() {
    int a = 0, b = 0;
    cin >> a >> b;
    cout << b / a;
    return 0;
}