// Дано натуральное число, выведите его последнюю цифру.

#include <iostream>

using namespace std;

int main() {
    // put your code here
    int a = 0;
    cin >> a;
    cout << a % 10;
    return 0;
}