// Дано двузначное число. Выведите его первую цифру (число десятков)

#include <iostream>

using namespace std;

int main() {
    int a = 0;
    cin >> a;
    cout << a / 10;
    return 0;
}