/* Hello, World */
int hello_world();

/* N белочек нашли K орешков и решили разделить их поровну.Определите, сколько орешков достанется каждой белочке.*/
int nuts_for_everyone();

/* N белочек нашли K орешков и решили разделить их поровну. Определите, сколько орешков останется после того, как все белочки возьмут себе равное количество орешков.*/
int nuts_left();

/* Дано натуральное число, выведите его последнюю цифру.*/
int last_digit();

/* Дано двузначное число. Выведите его первую цифру (число десятков) */
int first_digit_of_two();

/* Дано целое неотрицательное число N, определите число десятков в нем (предпоследнюю цифру числа).
 *Если предпоследней цифры нет, то можно считать, что число десятков равно нулю.
 */
int second_from_end_digit();

/* Дано целое трехзначное число. Найдите сумму его цифр. */
int sum_ciphr();